NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B820F2048IQ64.svd
        <register>
          <name>GRXSTSP</name>
          <description>Receive Status Read /Pop Register</description>
          <addressOffset>0xDE020</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <fields>
            <field>
              <name>CHNUM</name>
              <description>Channel Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BCNT</name>
              <description>Byte Count</description>
              <bitOffset>4</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID (host or device)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA0</name>
                  <description>DATA0 PID.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1</name>
                  <description>DATA1 PID.</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA2</name>
                  <description>DATA2 PID.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDATA</name>
                  <description>MDATA PID.</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKTSTS</name>
              <description>Packet Status (host or device)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GOUTNAK</name>
                  <description>Device mode: Global OUT NAK (triggers an interrupt).</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKTRCV</name>
                  <description>Host mode: IN data packet received. Device mode: OUT data packet received.</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XFERCOMPL</name>
                  <description>Host mode: IN transfer completed (triggers an interrupt). Device mode: OUT transfer completed (triggers an interrupt).</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETUPCOMPL</name>
                  <description>Device mode: SETUP transaction completed (triggers an interrupt).</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TGLERR</name>
                  <description>Host mode: Data toggle error (triggers an interrupt).</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETUPRCV</name>
                  <description>Device mode: SETUP data packet received.</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHLT</name>
                  <description>Host mode: Channel halted (triggers an interrupt).</description>
                  <value>0x00000007</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FN</name>
              <description>Frame Number</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRXFSIZ</name>
          <description>Receive FIFO Size Register</description>
          <addressOffset>0xDE024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>RXFDEP</name>
              <description>RxFIFO Depth</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GNPTXFSIZ</name>
          <description>Non-periodic Transmit FIFO Size Register</description>
          <addressOffset>0xDE028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x02000200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NPTXFSTADDR</name>
              <description>Non-periodic Transmit RAM Start Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NPTXFINEPTXF0DEP</name>
              <description>Non-periodic TxFIFO Depth (host only) / IN Endpoint TxFIFO 0 Depth (device only)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GNPTXSTS</name>
          <description>Non-periodic Transmit FIFO/Queue Status Register</description>
          <addressOffset>0xDE02C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00080200</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <fields>
            <field>
              <name>NPTXFSPCAVAIL</name>
              <description>Non-periodic TxFIFO Space Avail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPTXQSPCAVAIL</name>
              <description>Non-periodic Transmit Request Queue Space Available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPTXQTOP</name>
              <description>Top of the Non-periodic Transmit Request Queue</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GSNPSID</name>
          <description>Synopsys ID Register</description>
          <addressOffset>0xDE040</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x4F54330A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYNOPSYSID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GDFIFOCFG</name>
          <description>Global DFIFO Configuration Register</description>
          <addressOffset>0xDE05C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01F20200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GDFIFOCFG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPINFOBASEADDR</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPTXFSIZ</name>
          <description>Host Periodic Transmit FIFO Size Register</description>
          <addressOffset>0xDE100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x02000400</resetValue>
          <resetMask>0x03FF07FF</resetMask>
          <fields>
            <field>
              <name>PTXFSTADDR</name>
              <description>Host Periodic TxFIFO Start Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTXFSIZE</name>
              <description>Host Periodic TxFIFO Depth</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTXF1</name>
          <description>Device IN Endpoint Transmit FIFO Size Register 1</description>
          <addressOffset>0xDE104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x02000400</resetValue>
          <resetMask>0x03FF07FF</resetMask>
          <fields>
            <field>
              <name>INEPNTXFSTADDR</name>
              <description>IN Endpoint FIFOn Transmit RAM Start Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNTXFDEP</name>
              <description>IN Endpoint TxFIFO Depth</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTXF2</name>
          <description>Device IN Endpoint Transmit FIFO Size Register 2</description>
          <addressOffset>0xDE108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x02000600</resetValue>
          <resetMask>0x03FF07FF</resetMask>
          <fields>
            <field>
              <name>INEPNTXFSTADDR</name>
              <description>IN Endpoint FIFOn Transmit RAM Start Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNTXFDEP</name>
              <description>IN Endpoint TxFIFO Depth</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTXF3</name>
          <description>Device IN Endpoint Transmit FIFO Size Register 3</description>
          <addressOffset>0xDE10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x02000800</resetValue>
          <resetMask>0x03FF0FFF</resetMask>
          <fields>
            <field>
              <name>INEPNTXFSTADDR</name>
              <description>IN Endpoint FIFOn Transmit RAM Start Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNTXFDEP</name>
              <description>IN Endpoint TxFIFO Depth</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTXF4</name>
          <description>Device IN Endpoint Transmit FIFO Size Register 4</description>
          <addressOffset>0xDE110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x02000A00</resetValue>
          <resetMask>0x03FF0FFF</resetMask>
          <fields>
            <field>
              <name>INEPNTXFSTADDR</name>
              <description>IN Endpoint FIFOn Transmit RAM Start Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNTXFDEP</name>
              <description>IN Endpoint TxFIFO Depth</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTXF5</name>
          <description>Device IN Endpoint Transmit FIFO Size Register 5</description>
          <addressOffset>0xDE114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x02000C00</resetValue>
          <resetMask>0x03FF0FFF</resetMask>
          <fields>
            <field>
              <name>INEPNTXFSTADDR</name>
              <description>IN Endpoint FIFOn Transmit RAM Start Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNTXFDEP</name>
              <description>IN Endpoint TxFIFO Depth</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTXF6</name>
          <description>Device IN Endpoint Transmit FIFO Size Register 6</description>
          <addressOffset>0xDE118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x02000E00</resetValue>
          <resetMask>0x03FF0FFF</resetMask>
          <fields>
            <field>
              <name>INEPNTXFSTADDR</name>
              <description>IN Endpoint FIFOn Transmit RAM Start Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INEPNTXFDEP</name>
              <description>IN Endpoint TxFIFO Depth</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCFG</name>
          <description>Host Configuration Register</description>
          <addressOffset>0xDE400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x8000FF87</resetMask>
          <fields>
            <field>
              <name>FSLSPCLKSEL</name>
              <description>FS/LS PHY Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Internal PHY clock is running at 48 MHz (undivided).</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Internal PHY clock is running at 6 MHz (48 MHz divided by 8).</description>
                  <value>0x00000002</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSLSSUPP</name>
              <description>FS- and LS-Only Support</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENA32KHZS</name>
              <description>Enable 32 kHz Suspend Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESVALID</name>
              <description>Resume Validation Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODECHTIMEN</name>
              <description>Mode Change Time</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFIR</name>
          <description>Host Frame Interval Register</description>
          <addressOffset>0xDE404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000EA60</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>FRINT</name>
              <description>Frame Interval</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFIRRLDCTRL</name>
              <description>Reload Control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFNUM</name>
          <description>Host Frame Number/Frame Time Remaining Register</description>
          <addressOffset>0xDE408</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00003FFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRNUM</name>
              <description>Frame Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRREM</name>
              <description>Frame Time Remaining</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPTXSTS</name>
          <description>Host Periodic Transmit FIFO/Queue Status Register</description>
          <addressOffset>0xDE410</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00080200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PTXFSPCAVAIL</name>
              <description>Periodic Transmit Data FIFO Space Available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PTXQSPCAVAIL</name>
              <description>Periodic Transmit Request Queue Space Available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PTXQTOP</name>
              <description>Top of the Periodic Transmit Request Queue</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HAINT</name>
          <description>Host All Channels Interrupt Register</description>
          <addressOffset>0xDE414</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>HAINT</name>
              <description>Channel Interrupt for channel 0 - 13.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HAINTMSK</name>
          <description>Host All Channels Interrupt Mask Register</description>
          <addressOffset>0xDE418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>HAINTMSK</name>
              <description>Channel Interrupt Mask for channel 0 - 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
